app/controllers/products_controller.rb

  def index
    @products = Product.all.published.includes(:category).references(:category)
---
SELECT `products`.* FROM `products` WHERE `products`.`published` = 1